#ifndef __DS18b20Init_H 
#define __DS18b20Init_H

#include <tool.h>

/*****************************Ds18b20相关配置**************************/

/***********************************************************************
* 函数名：DS16B20Start
* 入参：无
* 返回值：无
* 函数功能：Ds18b20初始化
***********************************************************************/
void DS16B20Start(void)
{
	DQ = 1;
	delay_DS(1); 	/*1.45us*/
	DQ = 0;
	delay_DS(660); 	/*269.69us*/
	DQ = 1;
	while(DQ);
	delay_DS(660); 	/*269.69us */
	DQ = 1;
}

/***********************************************************************
* 函数名：WriteOneByte
* 入参：要写入的数据
* 返回值：无
* 函数功能：Ds18b20写函数
***********************************************************************/
void WriteOneByte(uchar dat)
{ 
	uint a = 0;

	for (a=8; a>0; a--) {
		DQ = 0; 
		DQ = dat & 0x01;
		delay_DS(74); 	/*31.15us*/
		DQ = 1;
		dat >>= 1;
		delay_DS(1);  	/*1.45us*/
	}
	delay_DS(65);	 	/*27.49us*/
}

/***********************************************************************
* 函数名：ReadOneByte
* 入参：无
* 返回值：读出来的数据
* 函数功能：Ds18b20读函数
***********************************************************************/
uchar ReadOneByte(void) 
{
	uchar i, dat;

	DQ = 1;
	delay_DS(1);	
	for (i=8; i>0; i--) {  
		DQ = 0;
		delay_DS(1);	/*1.45us*/
		DQ = 1;
		dat >>= 1;
		delay_DS(11);	/*5.52us*/
		if(DQ)
			dat |= 0x80;
		delay_DS(68);	/*28.71us*/
		DQ = 1;
		delay_DS(1);   	/*1.45us*/
	}

	return(dat);
}

#endif
