#ifndef __Tool_H 
#define __Tool_H

#include <base.h>

/***********************************************************************
* 函数名：SysclkInit
* 入参：无
* 返回值：无
* 函数功能：SYSCLK配置
***********************************************************************/
void SysclkInit (void)
{
	uint i;

	OSCXCN = 0x67;

	for (i=0; i < 256; i++) ;
	while (!(OSCXCN & 0x80)) ; 

	OSCICN = 0x88;
}

/***********************************************************************
* 函数名：PortInit
* 入参：无
* 返回值：无
* 函数功能：PORT配置
***********************************************************************/
void PortInit (void)
{
	XBR0 = 0x04;		/*使能 UART0*/
	XBR1 = 0x82;
	XBR2 = 0x40;
	P0MDOUT = 0xFF;		/*设为推挽方式*/
	P1MDOUT = 0xFF;
	P3MDOUT = 0xFF;
	P74OUT =0xFF;
	SCON0 = 0x50;		/*串口方式1*/
	TMOD = 0X20;		/*选用定时器1作为波特率发生器*/
	TH1 = 0xF4;
	TL1 = 0xF4;
	PCON = 0x80;		/*波特率为9600*/
	TR1 = 1;		/*定时器启动*/
}

/***********************************************************************
* 函数名：Conver
* 入参：要转换的字符数组
* 返回值：转换后的数字
* 函数功能：将数字字符转换为数字
***********************************************************************/
int Conver(uchar s[])
{
	int i = 0, k = 0;
	bit flag = 0;	

	while (s[i]) {
		if (s[i] >= '0' && s[i] <= '9') {
			if(!flag) {
				flag = 1;
				k = s[i] - '0';
			} else {
				k = k*10 + s[i] - '0';
			}
		}
		i++;
	}

	return k;
}

/***********************************************************************
* 函数名：CopyPhone
* 入参：uchar p_dis[] -- 电话号码的显示数组
*		uchar p[] -- 输入的电话号码数组
*		uchar len -- 数组长度
* 返回值：无
* 函数功能： 液晶延迟函数
***********************************************************************/
void CopyPhone(uchar p_dis[],uchar p[],uchar len)
{
	uchar i;

	memset(p_dis,0x00,len); 
	for (i=0; i<len; i ++) {
		p_dis[i] = p[i];
	}
}

void delay_DS(uint k)
{
	while(k--);   
}

/***********************************************************************
* 函数名：delay_LCD
* 入参：m --设置的延迟计数
* 返回值：无
* 函数功能： 液晶延迟函数
***********************************************************************/
void DelayLCD(uint m)            
{
	uint i, j;

	for (i=0; i<m; i++)
		for (j=0; j<100; j++)
			;
}

/***********************************************************************
* 函数名：delay1ms
* 入参： time  设置的延迟计数
* 返回值：无
* 函数功能：延时1ms*time
***********************************************************************/
void delay1ms(uint time)  
{
	uint i, j;

	for(i=0;i<time;i++)
		for(j=0;j<300;j++)
			;
}

#endif
